Revit 2027 API
RebarSpliceGeometry.SpliceNormal Property
 Identifies the splice face normal.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ SpliceNormal { get; set; }
Public Property SpliceNormal As XYZ
	Get
	Set
public:
property XYZ^ SpliceNormal {
	XYZ^ get ();
	void set (XYZ^ value);
}
member SpliceNormal : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
ArgumentOutOfRangeException |  When setting this property: spliceNormal has zero length.
See Also
Reference
RebarSpliceGeometry Class
Autodesk.Revit.DB.Structure Namespace